/*<![CDATA[*/
/**
 * 阴历。
 */
var LunarCalendar = function(){
	
};
/**
 * 天干地支。
 */
LunarCalendar.CHINESE_ERA = {
	GAN : ["甲","乙","丙","丁","戊","己","庚","辛","壬","癸"], // 干
	ZHI : ["子","丑","寅","卯","辰","巳","午","未","申","酉","戌","亥"] // 支
};
/**
 * 二十四节气
 * @type {Array}
 */
LunarCalendar.SLOAR_TERM = ["小寒","大寒","立春","雨水","惊蛰","春分",
	"清明","谷雨","立夏","小满","芒种","夏至",
	"小暑","大暑","立秋","处暑","白露","秋分",
	"寒露","霜降","立冬","小雪","大雪","冬至"];
/**
 * 二十四节气资料。
 * @type {Array}
 */
LunarCalendar.SLOAR_TERM_INFO = [0,21208,42467,63836,85337,107014,
	128867,150921,173149,195551,218072,240693,
	263343,285989,308563,331033,353350,375494,
	397447,419210,440795,462224,483532,504758];

LunarCalendar.get

/*]]>*/